selenium/feature_tests/src/test/resources/testfiles/genricReportingUAE/RR_SA_ICH_DEACTIVATE.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:cxf="http://cxf.component.camel.apache.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <n1:envelope xmlns:n1="http://www.sap.com/sap_ich4ls/"
                     xmlns:prx="urn:sap.com:proxy:Y21:/1SAI/TAS8FB8FF2B37F00B51AA2D:740"
                     xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
            <message date="2022-07-14" time="07:53:37">
                <id>42010AEECDE11EED90E3752A3C1ED08B</id>
            </message>
            <sender agency="GS1" scheme="GLN">0355801000002</sender>
            <recipients>
                <id agency="SAP" scheme="RegReport">RR_SA_ICH_DEACTIVATE</id>
            </recipients>
            <content encoding="XML" format="ATTP" type="GenericReporting" version="1.0">
                <ATTPGRDocument>
                    <GRHeader>
                        <GRHeaderBase>
                            <ReceiverId>RR_SA_ICH_DEACTIVATE</ReceiverId>
                            <InstanceId>42010AEECDE11EED90E3752A3C1ED08B</InstanceId>
                            <DateTime>2022-10-03T13:02:40Z</DateTime>
                            <VariantName>RR_SA_DEACTIVATE</VariantName>
                            <VariantVersion>1</VariantVersion>
                        </GRHeaderBase>
                        <ContentList>
                            <Content type="Event">
                                <ContentItem id="0-">
                                    <ContentItemSection type="Attributes">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtPrpRrSaDeactivateExp">STOLEN</attribute>
                                            <attribute id="sttpEvtPrpRrSaDeactivateRc">01</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                </ContentItem>
                            </Content>
                        </ContentList>
                    </GRHeader>
                    <GRBody>
                        <ObjContentList>
                            <ObjContent type="LotRefList">
                                <ObjContentGroup>
                                    <ObjCode id="011122334455667510SFDAQOSAIBI1823" type="LGTIN" dateManuf="2022-10-03"
                                             dateExp="2023-10-03"/>
                                </ObjContentGroup>
                            </ObjContent>
                            <ObjContent type="SGTINList">
                                <ObjContentGroup>
                                    <ObjCode id="011122334455667521K4DTSB4YOE3" type="SGTIN" lotRef="SFDAQOSAIBI1823"/>
                                    <ObjCode id="011122334455667521HEJ6R8X2QRU" type="SGTIN" lotRef="SFDAQOSAIBI1823"/>
                                </ObjContentGroup>
                            </ObjContent>
                        </ObjContentList>
                    </GRBody>
                </ATTPGRDocument>
            </content>
        </n1:envelope>
    </soapenv:Body>
</soapenv:Envelope>